RUSSIA_SUBJECTS = {

    "москва": "москва", "санкт-петербург": "санкт-петербург", "севастополь": "севастополь",

    "адыгея": "майкоп", "алтай": "горно-алтайск", "башкортостан": "уфа", "бурятия": "улан-удэ", "дагестан": "махачкала",
    "донецкий": "донецк", "ингушетия": "магас", "кабардино-балкарский": "нальчик", "калмыкия": "элиста",
    "карачаево-черкесский": "черкесск", "карелия": "петрозаводск", "коми": "сыктывкар", "крым": "симферополь",
    "луганский": "луганск", "марий эл": "йошкар-ола", "мордовия": "саранск", "саха": "якутск",
    "осетия-алания": "владикавказ", "татарстан": "казань", "тыва": "кызыл", "удмуртский": "ижевск", "хакасия": "абакан",
    "чеченский": "грозный", "чувашский": "чебоксары",

    "амурский": "благовещенск", "архангельский": "архангельск", "астраханский": "астрахань", "белгородский": "белгород",
    "брянский": "брянск", "челябинский": "челябинск", "владимирский": "владимир", "волгоградский": "волгоград",
    "вологодский": "вологда", "воронежский": "воронеж", "запорожский": "мелитополь", "иркутский": "иркутск",
    "ивановский": "иваново", "калининградский": "калининград", "калужский": "калуга", "кемеровский": "кемерово",
    "кировский": "киров", "костромской": "кострома", "курганский": "курган", "курский": "курск",
    "ленинградский": "санкт-петербург", "липецкий": "липецк", "магаданский": "магадан", "московский": "москва",
    "мурманский": "мурманск", "нижегородский": "нижний новгород", "новгородский": "великий новгород",
    "новосибирский": "новосибирск", "омский": "омск", "оренбургский": "оренбург", "орловский": "орёл",
    "пензенский": "пенза", "псковский": "псков", "ростовский": "ростов-на-дону", "рязанский": "рязань",
    "сахалинский": "южно-сахалинск", "самарский": "самара", "саратовский": "саратов", "смоленский": "смоленск",
    "свердловский": "свердловск", "тамбовский": "тамбов", "томский": "томск", "тверская": "тверь", "тульский": "тула",
    "тюменский": "тюмень", "ульяновский": "ульяновск", "херсонский": "геническ", "ярославский": "ярославль",
    "еврейский": "биробиджан",

    "алтайский": "барнаул", "камчатский": "петропавловск-камчатский", "хабаровский": "хабаровск",
    "краснодарский": "краснодар", "красноярский": "красноярск", "пермский": "пермь", "приморский": "владивосток",
    "ставропольский": "ставрополь", "забайкальский": "чита",

    "ненецкий": "нарьян-мар", "ханты-мансийский": "ханты-мансийск", "чукотский": "анадырь", "ямало-ненецкий": "салехард"

}

AREAS = ['центральный', 'северо-западный', 'южный', 'северо-кавказский', 'приволжский', 'уральский',
         'сибирский', 'дальневосточный']

KEYS_AREA = ['ареал']

KEYS_SUBJECT = ['республика', 'область', 'край', 'округ']

FULL_RUSSIA_SUBJECTS = {

    "москва": "Москва", "санкт-петербург": "Санкт-Петербург", "севастополь": "Севастополь",

    "адыгея": "Республика Адыгея", "алтай": "Республика Алтай", "башкортостан": "Республика Башкортостан",
    "бурятия": "Республика Бурятия", "дагестан": "Республика Дагестан",
    "донецкий": "Донецкая народная республика", "ингушетия": "Республика Ингушетия",
    "кабардино-балкарский": "Кабардино-Балкарская Республика", "калмыкия": "Республика Калмыкия",
    "карачаево-черкесский": "Карачаево-Черкесская Республика", "карелия": "Республика Карелия",
    "коми": "Республика Коми", "крым": "Республика Крым",
    "луганский": "Луганская народная республика", "марий эл": "Республика Марий Эл", "мордовия": "Республика Мордовия",
    "саха": "Республика Саха",
    "осетия-алания": "Республика Северная Осетия-Алания", "татарстан": "Республика Татарстан",
    "тыва": "Республика Тыва", "удмуртский": "Удмуртская Республика", "хакасия": "Республика Хакасия",
    "чеченский": "Чеченская Республика", "чувашский": "Чувашская Республика",

    "амурский": "Амурская область", "архангельский": "Архангельская область", "астраханский": "Астраханская область",
    "белгородский": "Белгородская область",
    "брянский": "Брянская область", "челябинский": "Челябинская область", "владимирский": "Владимирская область",
    "волгоградский": "Волгоградская область",
    "вологодский": "Вологодская область", "воронежский": "Воронежская область", "запорожский": "Запорожская область",
    "иркутский": "Иркутская область",
    "ивановский": "Ивановская область", "калининградский": "Калининградская область", "калужский": "Калужская область",
    "кемеровский": "Кемеровская область",
    "кировский": "Кировская область", "костромской": "Костромская область", "курганский": "Курганская область",
    "курский": "Курская область",
    "ленинградский": "Ленинградская область", "липецкий": "Липецкая область", "магаданский": "Магаданская область",
    "московский": "Московская область",
    "мурманский": "Мурманская область", "нижегородский": "Нижегородская область",
    "новгородский": "Новгородская область",
    "новосибирский": "Новосибирская область", "омский": "Омская область", "оренбургский": "Оренбургская область",
    "орловский": "Орловская область",
    "пензенский": "Пензенская область", "псковский": "Псковская область", "ростовский": "Ростовская область",
    "рязанский": "Рязанская область",
    "сахалинский": "Сахалинская область", "самарский": "Самарская область", "саратовский": "Саратовская область",
    "смоленский": "Смоленская область",
    "свердловский": "Свердловская область", "тамбовский": "Тамбовская область", "томский": "Томская область",
    "тверская": "Тверская область", "тульский": "Тульская область",
    "тюменский": "Тюменская область", "ульяновский": "Ульяновская область", "херсонский": "Херсонская область",
    "ярославский": "Ярославская область",
    "еврейский": "Еврейская автономная область",

    "алтайский": "Алтайский край", "камчатский": "Камчатский край", "хабаровский": "Хабаровский край",
    "краснодарский": "Краснодарский край", "красноярский": "Красноярский край", "пермский": "Пермский край",
    "приморский": "Приморский край",
    "ставропольский": "Ставропольский край", "забайкальский": "Забайкальский край",

    "ненецкий": "Ненецкий автономный округ", "ханты-мансийский": "Ханты-Мансийский автономный округ",
    "чукотский": "Чукотский автономный округ", "ямало-ненецкий": "Ямало-Ненецкий автономный округ"

}

PERIOD = ['январь', 'февраль', 'март', 'апрель', 'май', 'июнь', 'июль', 'август', 'сентябрь', 'октябрь',
          'ноябрь', 'декабрь']

KEYS_SOWING = ['посев']

KEYS_COLLECTING = ['сбор', 'урожай']


